/**************************************************************************
* Copyright    : Copyright(C), 2019, pxf, person.
* File name    : Cpn3.h
* Author       : pxf
* Version      : v1.0
* Created on   : 2019/12/29 14:52:38
* Description  : 
* Others       : 
* History      : 191229 pxf 初次建立
***************************************************************************/

#ifndef CPN3_H_
#define CPN3_H_

/*头文件包含*/
#include "../Rte/Rte.h"

/***********************************************************
* get set 数据类型定义
* 一般只定义set数据，get类型引用当前头文件
* 只需要把发送的数据定义出来，收发接口使用的是统一接口，无其他定义
* 信号数据类型一般来说都得强制定义一遍，否则很难知道信号对应数据是什么
***********************************************************/
/*发送数据类型
***********************************************/



/***********************************************************
* serv trig 数据类型定义
* 一般只定义serv数据，trig类型引用当前头文件
* 信号数据类型一般来说都得强制定义一遍，否则很难知道信号对应数据是什么
***********************************************************/
/*服务数据类型
***********************************************/



/***********************************************************
* serv trig 信号接口定义
* 类继承的接口就是触发信号接口，在接口函数中使用触发信号进行触发
***********************************************************/
/*服务
***********************************************/
void serv_Cpn3_taskInit(void);
void serv_Cpn3_serv1(void);
void serv_Cpn3_serv2(void *buff);
/*接口触发
***********************************************/



/***********************************************************
* get set信号列表
***********************************************************/
/*发送信号列表
***********************************************/
#define SIGNAL_SET_LIST_RTEASYN_CPN3(_)                    \
    _(sig_set_Cpn3_send1,sizeof(uint16))                   \
    _(sig_set_Cpn3_send2,sizeof(uint8)*3)                  \

/*接收信号列表
* 配置信号时需要检查发送信号的长度对信号进行映射
***********************************************/
#define SIGNAL_GET_MAP_LIST_RTEASYN_CPN3(_)                \



/***********************************************************
* trig serv信号列表
***********************************************************/
/*服务信号列表
***********************************************/
#define SIGNAL_SERV_LIST_RTESYN_CPN3(_)                    \
    _(sig_serv_Cpn3_taskInit,serv_Cpn3_taskInit)           \
    _(sig_serv_Cpn3_serv1,serv_Cpn3_serv1)                 \
    _(sig_serv_Cpn3_serv2,serv_Cpn3_serv2)                 \

/*触发信号列表
* 配置信号时需要检查服务信号的长度对信号进行映射
***********************************************/
#define  SIGNAL_TRIG_MAP_LIST_RTESYN_CPN3(_)                \
    _(sig_trig_Cpn3_addTask,sig_serv_CpnSch_addTask)       \



/***********************************************************
* 组件运行任务
***********************************************************/
void taskCpn3(void);

#endif /*CPN3_H_*/

/**************************** Copyright(C) pxf ****************************/
