/**************************************************************************
* Copyright    : Copyright(C), 2019, pxf, person.
* File name    : CpnSchSigs.h
* Author       : pxf
* Version      : v1.0
* Created on   : 2019/12/28 21:27:20
* Description  : 
* Others       : 
* History      : 191228 pxf 初次建立
***************************************************************************/

#ifndef CPNSCHSIGS_H_
#define CPNSCHSIGS_H_

/*头文件包含*/
#include "../standType/standType.h"
#include "./CpnSch.h"

/***********************************************************
* get set 数据类型定义
***********************************************************/
/*发送参数
***********************************************/


/***********************************************************
* get set 信号接口定义
***********************************************************/
/*发送
***********************************************/



/***********************************************************
* get set 数据类型定义
***********************************************************/

/***********************************************************
* serv trig 数据类型定义
***********************************************************/
/*添加任务服务参数
***********************************************/
typedef struct addTaskParam{
    uint16 level;
    task t;
    uint16 prdTick;
    uint16 startTick;
}addTaskParam, *haddTaskParam;
/*删除任务服务参数
***********************************************/
typedef struct delTaskParam{
    uint16 level;
    task t;
}delTaskParam, *hdelTaskParam;
/*延时服务参数
***********************************************/
typedef uint32 tick;
/*实时服务参数
***********************************************/
typedef uint16 point;


/***********************************************************
* serv trig 信号接口定义
***********************************************************/
/*添加任务服务
***********************************************/
void serv_CpnSch_addTask(void *buff, uint16 buffLen);
/*删除任务服务
***********************************************/
void serv_CpnSch_delTask(void *buff, uint16 buffLen);
/*延时服务
***********************************************/
void serv_CpnSch_delay(void *buff, uint16 buffLen);
/*实时服务
***********************************************/
void serv_CpnSch_time(void *buff, uint16 buffLen);

/*初始化触发
***********************************************/
void trig_CpnSch_init(void);
/*运行触发
***********************************************/
void trig_CpnSch_run(void);
/*步长触发
***********************************************/
void trig_CpnSch_tick(void);
/*实时触发
***********************************************/
void trig_CpnSch_time(void *buff, uint16 buffLen);


/***********************************************************
* 接口定义
***********************************************************/
/*读取实时接口
***********************************************/
void getTime(uint16 *point);
/*发送错误码接口
***********************************************/
void setErr(uint16 id, uint16 code);

#endif /*CPNSCHSIGS_H_*/

/**************************** Copyright(C) pxf ****************************/
