/**************************************************************************
* Copyright    : Copyright(C), 2019, pxf, person.
* File name    : CpnSch2Sigs.c
* Author       : pxf
* Version      : v1.0
* Created on   : 2020/01/01 13:18:37
* Description  : CpnSch2组件信号定义源文件
* Others       : 
* History      : 200101 pxf 初次建立
***************************************************************************/

/*头文件包含*/
#include "./CpnSch2Sigs.h"
#include "../RteSigs/RetSigs.h"

/***********************************************************
* CpnSch2类定义
***********************************************************/
/*CpnSch2类
***********************************************/
CpnSch2 clCpnSch2;


/***********************************************************
* serv trig 信号接口定义
* 类继承的接口就是触发信号接口，在接口函数中使用触发信号进行触发
***********************************************************/
/*组件初始化服务
***********************************************/
void serv_CpnSch2_init(void){
    CN(CpnSch2,&clCpnSch2);
    if(OPRS(clCpnSch2) != NULL){}
}

/*服务
***********************************************/
void serv_CpnSch2_run(void){}
/*服务
***********************************************/
void serv_CpnSch2_tick(void){}
/*服务
***********************************************/
void serv_CpnSch2_now(void){}
/*服务
***********************************************/
void serv_CpnSch2_delay(void){}
/*服务
***********************************************/
void serv_CpnSch2_addTask(void){}
/*服务
***********************************************/
void serv_CpnSch2_delTask(void){}

/*接口触发
***********************************************/
//void trig_CpnSch2_inf_infFunc(void){}

/**************************** Copyright(C) pxf ****************************/
