/**************************************************************************
* Copyright    : Copyright(C), 2019, pxf, person.
* File name    : RteSigs.c
* Author       : pxf
* Version      : v1.0
* Created on   : 2019/12/29 15:41:45
* Description  : 
* Others       : 
* History      : 191229 pxf 初次建立
***************************************************************************/

/*头文件包含*/
#include "./RteSigs.h"

/*名称 : RteSigs()
* 输入 : 无
* 输出 : 无
* 其他 : 无
***********************************************/
void RteSigs(void){
}

/**************************** Copyright(C) pxf ****************************/
