/**************************************************************************
* Copyright    : Copyright(C), 2019, pxf, person.
* File name    : Cpn2.h
* Author       : pxf
* Version      : v1.0
* Created on   : 2019/12/29 14:52:35
* Description  : 
* Others       : 
* History      : 191229 pxf 初次建立
***************************************************************************/

#ifndef CPN2_H_
#define CPN2_H_

/*头文件包含*/
// #include "../standType/standType.h"
// #include "../Rte/RteAsyn.h"
// #include "../Rte/RteSyn.h"
// #include "../Rte/SetGet.h"
#include "../Rte/Rte.h"

/***********************************************************
* get set 数据类型定义
* 一般只定义set数据，get类型引用当前头文件
* 只需要把发送的数据定义出来，收发接口使用的是统一接口，无其他定义
***********************************************************/
/*发送参数
***********************************************/



/***********************************************************
* serv trig 数据类型定义
* 一般只定义serv数据，trig类型引用当前头文件
***********************************************************/
/*添加任务服务参数
***********************************************/


/***********************************************************
* serv trig 信号接口定义
* 类继承的接口就是触发信号接口，在接口函数中使用触发信号进行触发
***********************************************************/
/*添加任务服务
***********************************************/
/*错误码接口触发
***********************************************/
void trig_Cpn2_trig1(void *buff, uint16 buffLen);
void trig_Cpn2_trig2(void *buff, uint16 buffLen);
void trig_Cpn2_trig3(void);


/***********************************************************
* get set信号列表
***********************************************************/
/*发送信号列表
***********************************************/
/*接收信号列表
* 配置信号时需要检查发送信号的长度对信号进行映射
***********************************************/
#define SIGNAL_GET_MAP_LIST_RTEASYN_CPN2(_)               \
    _(sig_get_Cpn2_receive1,sig_set_Cpn1_send2)           \
    _(sig_get_Cpn2_receive2,sig_set_Cpn1_send1)           \
    _(sig_get_Cpn2_receive3,sig_set_Cpn1_send3)


/***********************************************************
* trig serv信号列表
***********************************************************/
/*服务信号列表
***********************************************/
/*触发信号列表
* 配置信号时需要检查服务信号的长度对信号进行映射
***********************************************/
#define SIGNAL_TRIG_MAP_LIST_RTESYN_CPN2(_)                           \
    _(sig_trig_Cpn2_trig1,sig_serv_Cpn1_serv2,sizeof(uint32))         \
    _(sig_trig_Cpn2_trig2,sig_serv_Cpn1_serv3,sizeof(uint8)*5)        \
    _(sig_trig_Cpn2_trig3,sig_serv_Cpn1_serv1,0)

/***********************************************************
* 组件运行任务
***********************************************************/
void taskCpn2(void);

#endif /*CPN2_H_*/

/**************************** Copyright(C) pxf ****************************/
